Let me re-write the steps:
-------------------------------

1. Go to Azure portal, go to some resource group, create a public static ip address directly on the portal.

2. Create `main.tf` with following content:

```
provider "azurerm" {
  features {}
}

resource "azurerm_public_ip" "test" {
  name                = "test-ip"
  resource_group_name = "rg"
  location            = "West Europe"
  allocation_method   = "Static"
  sku                 = "Standard"
}
```

3. Run: `terraform init`

```
Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/azurerm...
- Installing hashicorp/azurerm v2.27.0...
- Installed hashicorp/azurerm v2.27.0 (signed by HashiCorp)

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, we recommend adding version constraints in a required_providers block
in your configuration, with the constraint strings suggested below.

* hashicorp/azurerm: version = "~> 2.27.0"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

4. Run: `terraform import azurerm_public_ip.test /subscriptions/xxx-xxx-xxx-xxx-xxx/resourceGroups/rg/providers/Microsoft.Network/publicIPAddresses/test-ip`

```
azurerm_public_ip.test: Importing from ID "/subscriptions/xxx-xxx-xxx-xxx-xxx/resourceGroups/rg/providers/Microsoft.Network/publicIPAddresses/test-ip"...
azurerm_public_ip.test: Import prepared!
  Prepared azurerm_public_ip for import
azurerm_public_ip.test: Refreshing state... [id=/subscriptions/xxx-xxx-xxx-xxx-xxx/resourceGroups/rg/providers/Microsoft.Network/publicIPAddresses/test-ip]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
```

4. Run: `terraform plan`

```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_public_ip.test: Refreshing state... [id=/subscriptions/xxx-xxx-xxx-xxx-xxx/resourceGroups/rg/providers/Microsoft.Network/publicIPAddresses/test-ip]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_public_ip.test must be replaced
-/+ resource "azurerm_public_ip" "test" {
        allocation_method       = "Static"
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/xxx-xxx-xxx-xxx-xxx/resourceGroups/rg/providers/Microsoft.Network/publicIPAddresses/test-ip" -> (known after apply)
        idle_timeout_in_minutes = 4
      ~ ip_address              = "x.x.x.x" -> (known after apply)
        ip_version              = "IPv4"
        location                = "westeurope"
        name                    = "test-ip"
      - public_ip_prefix_id     = "/subscriptions/xxx-xxx-xxx-xxx-xxx/resourceGroups/rg/providers/Microsoft.Network/publicIPPrefixes/test-prefix" -> null # forces replacement
        resource_group_name     = "rg"
        sku                     = "Standard"
      - tags                    = {
          - "Self Managed" = "Yes"
        } -> null
      - zones                   = [] -> null

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

Observation
---------------
Now if you see, it's actually going to destroy the existing IP and recreate it. In my infrastructure I have couple of IP's which are tied up with resources & those should not be re-created.
